{
  "metadata": {
    "title": "Beneath the House",
    "version": "1.0",
    "start_node": "start",
    "total_nodes": 95,
    "acts": 5,
    "endings": 4
  },
  "settings": {
    "text_speed": 30,
    "default_background": "backgrounds/default.png",
    "default_music": "music/ambient.wav",
    "font_size": 24,
    "choice_font_size": 20
  },
  "nodes": {
    "start": {
      "id": "start",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/start.png",
      "music": "music/start.wav",
      "text": "You pull into the driveway at 7:43 PM. Late again. The porch light is on—Morgan remembered tonight. Inside, the house smells like reheated soup. Something from a can. The TV murmurs from the living room. You find Morgan on the couch, wrapped in the old blue blanket from your parents' house. She looks up when you come in. Tired, but present. A good day, then. You've learned to recognize them. \"Hey. There's soup if you want some.\" You drop your bag by the door. Ask about her day. \"Actually decent.\" She shifts to make room for you, though you haven't sat yet. \"I found this online group. Support thing, for people with... you know. Chronic stuff. It's nice. Talking to people who get it.\"",
      "choices": [
        {"label": "\"That's great. I'm glad you found people to talk to.\"", "target": "scene1.1"},
        {"label": "\"What kind of group? What do they talk about?\"", "target": "scene1.2"},
        {"label": "\"Just be careful with online stuff. Lots of weirdos out there.\"", "target": "scene1.3"}
      ],
      "position": {"x": 199, "y": 13}
    },
    "scene1.1": {
      "id": "scene1.1",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/start.png",
      "music": "music/start.wav",
      "text": "Morgan smiles. It reaches her eyes—rare, these days. \"Yeah. Me too.\" She pulls the blanket tighter. \"They're really welcoming. No pity, no toxic positivity. Just... understanding.\" You feel something loosen in your chest. Maybe you don't have to carry this alone. Later, as you're heading to bed, Morgan calls out from the couch. \"Hey. Want to watch something? There's this documentary about deep-sea creatures. Supposed to be really good.\" You have work early tomorrow. The kind of early that makes 6 AM feel like a personal insult.",
      "choices": [
        {"label": "Stay and watch the documentary.", "target": "scene1_movie_stay"},
        {"label": "\"I'm sorry, I really need to sleep. Early morning.\"", "target": "scene1_movie_decline"},
        {"label": "\"Maybe something short? Like an episode of something?\"", "target": "scene1_movie_compromise"}
      ],
      "position": {"x": 23, "y": 145}
    },
    "scene1.2": {
      "id": "scene1.2",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/start.png",
      "music": "music/start.wav",
      "text": "Morgan's expression flickers. Just for a second. \"Coping, mostly. Pain management. Acceptance.\" She shrugs. \"Normal stuff. Why?\" \"Just curious.\" \"Mm.\" She turns back to the TV. The openness from a moment ago has receded slightly. You're not sure why. Later, as you're heading to bed, Morgan calls out from the couch. \"Hey. Want to watch something? There's this documentary about deep-sea creatures. Supposed to be really good.\" You have work early tomorrow. The kind of early that makes 6 AM feel like a personal insult.",
      "choices": [
        {"label": "Stay and watch the documentary.", "target": "scene1_movie_stay"},
        {"label": "\"I'm sorry, I really need to sleep. Early morning.\"", "target": "scene1_movie_decline"},
        {"label": "\"Maybe something short? Like an episode of something?\"", "target": "scene1_movie_compromise"}
      ],
      "position": {"x": 204, "y": 141}
    },
    "scene1.3": {
      "id": "scene1.3",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/start.png",
      "music": "music/start.wav",
      "text": "Morgan's jaw tightens. \"I'm sick, not stupid.\" \"That's not what I—\" \"I know.\" She exhales. \"Sorry. I just... I finally found something that helps, and I don't want to defend it already.\" The silence that follows has weight to it. Later, as you're heading to bed, Morgan calls out from the couch. Her voice is softer now. \"Hey. Want to watch something? There's this documentary about deep-sea creatures. Supposed to be really good.\" You have work early tomorrow. The kind of early that makes 6 AM feel like a personal insult.",
      "choices": [
        {"label": "Stay and watch the documentary.", "target": "scene1_movie_stay"},
        {"label": "\"I'm sorry, I really need to sleep. Early morning.\"", "target": "scene1_movie_decline"},
        {"label": "\"Maybe something short? Like an episode of something?\"", "target": "scene1_movie_compromise"}
      ],
      "position": {"x": 383, "y": 144}
    },
    "scene1_movie_stay": {
      "id": "scene1_movie_stay",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/living_room_night.png",
      "music": "music/peaceful.wav",
      "text": "You settle onto the couch beside her. Morgan makes a small, pleased sound and shifts closer, sharing the blanket. The documentary is strange and beautiful—bioluminescent creatures pulsing in the dark, things that live where light never reaches. \"Imagine living down there,\" Morgan says quietly. \"In all that pressure. All that darkness. And you just... adapt.\" You're only half-watching. Mostly you're noticing how Morgan keeps scratching absently at her wrist. A new habit. The skin there looks raw. When the credits roll, she's asleep against your shoulder. You carry her to bed, careful not to wake her. She weighs less than she should.",
      "choices": [
        {"label": "Continue", "target": "night2_intro"}
      ],
      "position": {"x": 120, "y": 280}
    },
    "scene1_movie_decline": {
      "id": "scene1_movie_decline",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/hallway_night.png",
      "music": "music/quiet.wav",
      "text": "\"I'm really sorry. I have that 6 AM—\" \"It's okay.\" Morgan's voice is light, practiced. \"I understand.\" But her eyes have already gone somewhere else. That look you've seen before—the one that says she expected this. That she's used to being left alone. \"We'll do something this weekend,\" you offer. \"Yeah.\" She turns back to the TV. \"Night.\" You lie in bed for a long time, staring at the ceiling, listening to the muffled sounds of whatever she's watching. Wondering when every small moment started feeling like a test you're failing.",
      "choices": [
        {"label": "Continue", "target": "night2_intro"}
      ],
      "position": {"x": 280, "y": 280}
    },
    "scene1_movie_compromise": {
      "id": "scene1_movie_compromise",
      "act": 1,
      "scene": "night1",
      "background": "backgrounds/living_room_night.png",
      "music": "music/peaceful.wav",
      "text": "You compromise on an old sitcom—something brainless and familiar. Morgan seems distracted the whole time, glancing at her phone occasionally. When it buzzes, she smiles at whatever she sees. \"Group chat,\" she explains when she catches you looking. \"Someone shared a really good article.\" \"About what?\" \"Just... coping stuff.\" She locks the phone. \"Mind if we finish this tomorrow? I'm actually kind of tired.\" You say goodnight, but something about the exchange leaves you unsettled. Not worried, exactly. Just... aware that something is shifting that you can't quite name.",
      "choices": [
        {"label": "Continue", "target": "night2_intro"}
      ],
      "position": {"x": 440, "y": 280}
    },
    "night2_intro": {
      "id": "night2_intro",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/house_exterior_dusk.png",
      "music": "music/uneasy.wav",
      "text": "One week later. You come home and the house feels different. The air is thick with something—incense, maybe. Earthy and unfamiliar. Sweet in a way that coats the back of your throat. The living room is dark. No TV. No lights. Morgan is sitting on the floor, cross-legged, facing the window. Her back is to you. She's more energetic than she's been in months. Practically vibrating with it. \"You're home.\" She doesn't turn around. \"I've been thinking about something all day. About acceptance.\" She stands, finally faces you. She's wearing something new—a pendant. A simple circle with a vertical line through it, hanging from a leather cord.",
      "choices": [
        {"label": "\"That's new. Where'd you get it?\"", "target": "night2_pendant_ask"},
        {"label": "Say nothing about the pendant. Just listen.", "target": "night2_pendant_silent"},
        {"label": "\"Is that from your group?\"", "target": "night2_pendant_group"}
      ],
      "position": {"x": 280, "y": 420}
    },
    "night2_pendant_ask": {
      "id": "night2_pendant_ask",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/living_room_dark.png",
      "music": "music/uneasy.wav",
      "text": "Morgan's hand goes to the pendant, protective. \"A friend gave it to me. From the group.\" She smiles, but there's something guarded in it. \"It's just a symbol. Helps me focus.\" \"Focus on what?\" \"On what matters.\" She turns away, moving toward the kitchen. \"The group has been talking about something interesting. About 'what's underneath.' How we spend so much energy fighting against things instead of accepting what's already there.\"",
      "choices": [
        {"label": "\"Try me. What are they telling you?\"", "target": "night2_press"},
        {"label": "Let it go. She seems happy, and that's rare.", "target": "night2_let_go"},
        {"label": "\"This is starting to sound weird. Are you okay?\"", "target": "night2_concern"}
      ],
      "position": {"x": 120, "y": 560}
    },
    "night2_pendant_silent": {
      "id": "night2_pendant_silent",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/living_room_dark.png",
      "music": "music/uneasy.wav",
      "text": "You don't mention the pendant. Your eyes trace its shape—circle, line—and file it away. Morgan seems to appreciate that you don't ask. Or maybe she doesn't notice at all. \"The group has been talking about something interesting,\" she continues. \"About 'what's underneath.' How we spend so much energy fighting against things instead of accepting what's already there.\" She looks at you expectantly. Waiting for a reaction.",
      "choices": [
        {"label": "\"Try me. What are they telling you?\"", "target": "night2_press"},
        {"label": "Let it go. She seems happy, and that's rare.", "target": "night2_let_go"},
        {"label": "\"This is starting to sound weird. Are you okay?\"", "target": "night2_concern"}
      ],
      "position": {"x": 280, "y": 560}
    },
    "night2_pendant_group": {
      "id": "night2_pendant_group",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/living_room_dark.png",
      "music": "music/uneasy.wav",
      "text": "Morgan stiffens slightly. \"Why do you say it like that?\" \"Like what?\" \"Like you think they're... I don't know. Selling me something.\" She shakes her head. \"It's just a symbol. It represents—\" She stops herself. \"Never mind. You wouldn't understand yet.\" The word 'yet' hangs in the air. \"The group has been talking about something interesting,\" she continues, her voice lighter now. Forced casual. \"About 'what's underneath.' How we spend so much energy fighting against things instead of accepting what's already there.\"",
      "choices": [
        {"label": "\"Try me. What are they telling you?\"", "target": "night2_press"},
        {"label": "Let it go. She seems happy, and that's rare.", "target": "night2_let_go"},
        {"label": "\"This is starting to sound weird. Are you okay?\"", "target": "night2_concern"}
      ],
      "position": {"x": 440, "y": 560}
    },
    "night2_press": {
      "id": "night2_press",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/living_room_dark.png",
      "music": "music/tense.wav",
      "text": "Morgan's smile doesn't waver, but her eyes go flat. \"You wouldn't understand. Not yet.\" \"That's not an answer.\" \"It's the only one I have.\" She moves past you toward the stairs. \"I'm tired. We can talk more tomorrow.\" But tomorrow, she won't mention it. And you'll be too afraid to ask. That night, you wake at 3 AM to the sound of footsteps upstairs. Not walking—pacing. Back and forth, back and forth. Then they stop. Somewhere near the water heater closet.",
      "choices": [
        {"label": "Get up and check on Morgan.", "target": "night2_investigate"},
        {"label": "Call out from bed. \"Morgan? You okay?\"", "target": "night2_call_out"},
        {"label": "Stay in bed. It's probably nothing.", "target": "night2_ignore"}
      ],
      "position": {"x": 120, "y": 700}
    },
    "night2_let_go": {
      "id": "night2_let_go",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/living_room_dark.png",
      "music": "music/uneasy.wav",
      "text": "You let it go. She seems happy—genuinely happy—for the first time in months. Whatever this group is doing for her, it's working. Isn't that what matters? \"I'm glad you found something that helps,\" you say. Morgan beams. \"I knew you'd understand.\" But later, lying in bed, you wonder if understanding and enabling are the same thing. At 3 AM, you wake to the sound of footsteps upstairs. Not walking—pacing. Back and forth, back and forth. Then they stop. Somewhere near the water heater closet.",
      "choices": [
        {"label": "Get up and check on Morgan.", "target": "night2_investigate"},
        {"label": "Call out from bed. \"Morgan? You okay?\"", "target": "night2_call_out"},
        {"label": "Stay in bed. It's probably nothing.", "target": "night2_ignore"}
      ],
      "position": {"x": 280, "y": 700}
    },
    "night2_concern": {
      "id": "night2_concern",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/living_room_dark.png",
      "music": "music/tense.wav",
      "text": "\"This is starting to sound like—\" \"Like what?\" Morgan's voice sharpens. \"Like a cult? Like I'm too stupid to know when I'm being manipulated?\" \"That's not what I said.\" \"It's what you meant.\" She takes a breath. Forces calm. \"I'm sorry. I just... I finally feel like I'm getting somewhere. Like I'm not just waiting to die.\" The words hit you like a slap. \"Morgan—\" \"I'm tired.\" She's already heading for the stairs. \"Goodnight.\" That night, you wake at 3 AM to the sound of footsteps upstairs. Not walking—pacing. Back and forth, back and forth. Then they stop. Somewhere near the water heater closet.",
      "choices": [
        {"label": "Get up and check on Morgan.", "target": "night2_investigate"},
        {"label": "Call out from bed. \"Morgan? You okay?\"", "target": "night2_call_out"},
        {"label": "Stay in bed. It's probably nothing.", "target": "night2_ignore"}
      ],
      "position": {"x": 440, "y": 700}
    },
    "night2_investigate": {
      "id": "night2_investigate",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/hallway_dark.png",
      "music": "music/dread.wav",
      "text": "You ease out of bed, feet cold on the hardwood. The hallway is dark. Silent now. Morgan's door is closed. You press your ear to it—nothing. Just the soft rhythm of breathing. Asleep. But the footsteps were real. You know they were. You stand in the hallway for a long moment, listening. A faint draft brushes your ankles. Coming from... where? The water heater closet? But that's an interior wall. There's nowhere for a draft to come from. You go back to bed. You don't sleep.",
      "choices": [
        {"label": "Continue", "target": "night3_intro"}
      ],
      "position": {"x": 120, "y": 840}
    },
    "night2_call_out": {
      "id": "night2_call_out",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/bedroom_dark.png",
      "music": "music/dread.wav",
      "text": "\"Morgan?\" Your voice sounds too loud in the darkness. \"You okay?\" Silence. Then, from upstairs: \"Go back to sleep.\" Her voice is strange. Thick. Like she's speaking through water. \"What are you doing up there?\" A long pause. \"Just... thinking. Go back to sleep.\" You lie there, heart pounding, listening to the silence where footsteps used to be. Eventually, you drift off. Your dreams are full of circles. Concentric rings, spiraling down and down and down.",
      "choices": [
        {"label": "Continue", "target": "night3_intro"}
      ],
      "position": {"x": 280, "y": 840}
    },
    "night2_ignore": {
      "id": "night2_ignore",
      "act": 1,
      "scene": "night2",
      "background": "backgrounds/bedroom_dark.png",
      "music": "music/dread.wav",
      "text": "Old houses make noises. That's what you tell yourself. Old houses settle and creak and sound like footsteps when you're half-asleep and already unsettled. You pull the blanket higher. Close your eyes. The footsteps don't return. But you swear, just before you drift off, you feel something. A warmth. Like breath on the back of your neck. There's no one there when you turn around.",
      "choices": [
        {"label": "Continue", "target": "night3_intro"}
      ],
      "position": {"x": 440, "y": 840}
    },
    "night3_intro": {
      "id": "night3_intro",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "The next night, everything is different. You come home and the house is silent. No TV. No music. No incense. Just stillness. Morgan is sitting at the kitchen table, hands folded in front of her. Waiting. Her face is calm. Too calm. The kind of peace that feels practiced, like a mask made of serenity. \"Sit down,\" she says. \"I need to tell you something.\" You sit. The chair scrapes too loud in the quiet. \"I've been chosen,\" Morgan says. Her eyes are bright, feverish. \"The Threshold Assembly has shown me what waits below. I'm not afraid anymore.\" She reaches across the table. Her hand is ice cold. \"The illness isn't punishment. It's preparation.\"",
      "choices": [
        {"label": "\"This is insane. You're in a cult.\"", "target": "night3_anger"},
        {"label": "\"You're scaring me. Please, just talk to me.\"", "target": "night3_fear"},
        {"label": "\"Let's see another doctor. A specialist. Please.\"", "target": "night3_bargain"},
        {"label": "Say nothing. Just listen.", "target": "night3_silent"}
      ],
      "position": {"x": 280, "y": 980}
    },
    "night3_anger": {
      "id": "night3_anger",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "\"A cult? That's what you think?\" Morgan's voice is gentle, pitying. That's almost worse than anger. \"You're being manipulated. These people are taking advantage of you because you're sick and scared and—\" \"I'm not scared anymore. That's the point.\" She squeezes your hand, cold fingers pressing. \"When I'm gone, don't look for me.\" Your heart stops. \"What do you mean, 'when you're gone'?\" \"But if you do—\" She pauses. Seems to catch herself. \"Never mind.\"",
      "choices": [
        {"label": "\"If I do, what? Finish the sentence.\"", "target": "night3_press_gone"},
        {"label": "\"You're not going anywhere.\"", "target": "night3_denial"},
        {"label": "\"I'm calling someone. A doctor. This isn't right.\"", "target": "night3_call_help"}
      ],
      "position": {"x": 60, "y": 1120}
    },
    "night3_fear": {
      "id": "night3_fear",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "Morgan's expression softens. For a moment, she looks like herself again—your sibling, tired and sick and scared. \"I know,\" she whispers. \"I know I'm scaring you. But I need you to understand—I'm not running from something. I'm running toward it.\" She squeezes your hand. \"When I'm gone, don't look for me.\" The words don't make sense. \"Gone where? Morgan, what are you—\" \"But if you do—\" She stops. Shakes her head. \"Never mind. It doesn't matter.\"",
      "choices": [
        {"label": "\"If I do, what? Finish the sentence.\"", "target": "night3_press_gone"},
        {"label": "\"You're not going anywhere.\"", "target": "night3_denial"},
        {"label": "\"I'm calling someone. A doctor. This isn't right.\"", "target": "night3_call_help"}
      ],
      "position": {"x": 200, "y": 1120}
    },
    "night3_bargain": {
      "id": "night3_bargain",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "\"We haven't tried everything. There are specialists, clinical trials—\" \"Stop.\" Morgan's voice is firm but not unkind. \"I've accepted what's happening. You should too.\" \"I can't accept losing you.\" \"You won't.\" She smiles, strange and serene. \"Not really. Not the way you think.\" She takes your hand. \"When I'm gone, don't look for me. But if you do—\" A pause. Her eyes flicker toward the ceiling. Toward the upstairs hallway. \"Never mind.\"",
      "choices": [
        {"label": "\"If I do, what? Finish the sentence.\"", "target": "night3_press_gone"},
        {"label": "\"You're not going anywhere.\"", "target": "night3_denial"},
        {"label": "\"I'm calling someone. A doctor. This isn't right.\"", "target": "night3_call_help"}
      ],
      "position": {"x": 340, "y": 1120}
    },
    "night3_silent": {
      "id": "night3_silent",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "You say nothing. Just listen. Watch. Morgan seems to appreciate this. Or maybe she's beyond caring about your reaction. \"They showed me what's underneath,\" she continues. \"Under the fear. Under the pain. Under... everything.\" Her eyes are distant, focused on something you can't see. \"When I'm gone, don't look for me.\" The words don't land right. They feel rehearsed. \"But if you do—\" She stops. Looks at you—really looks—for the first time all night. \"Never mind. You probably won't.\"",
      "choices": [
        {"label": "\"If I do, what? Finish the sentence.\"", "target": "night3_press_gone"},
        {"label": "\"You're not going anywhere.\"", "target": "night3_denial"},
        {"label": "\"I'm calling someone. A doctor. This isn't right.\"", "target": "night3_call_help"}
      ],
      "position": {"x": 480, "y": 1120}
    },
    "night3_press_gone": {
      "id": "night3_press_gone",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/dread.wav",
      "text": "Morgan holds your gaze for a long moment. Then, quietly: \"Follow the warm air.\" \"What does that mean?\" But she's already standing, already moving toward the stairs. \"I'm tired. Let's talk tomorrow.\" Before you go to bed, you notice something new in the upstairs hallway. A large woven tapestry, hung near the water heater closet. Abstract patterns in deep reds and browns. \"For energy flow,\" Morgan explains when she catches you looking. \"It helps balance the space.\"",
      "choices": [
        {"label": "Examine the tapestry closely.", "target": "night3_examine_tapestry"},
        {"label": "Accept the explanation.", "target": "night3_accept_tapestry"},
        {"label": "\"This is getting out of hand. What are you hiding?\"", "target": "night3_confront_tapestry"}
      ],
      "position": {"x": 140, "y": 1260}
    },
    "night3_denial": {
      "id": "night3_denial",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "\"You're not going anywhere.\" You say it like a command. Like you have any control over this. Over anything. Morgan just smiles. Sad and patient. The way you might smile at a child who doesn't understand death yet. \"Okay,\" she says. \"Sure.\" She stands. \"I'm tired. Let's talk tomorrow.\" Before you go to bed, you notice something new in the upstairs hallway. A large woven tapestry, hung near the water heater closet. Abstract patterns in deep reds and browns. \"For energy flow,\" Morgan says, appearing behind you. \"It helps balance the space.\"",
      "choices": [
        {"label": "Examine the tapestry closely.", "target": "night3_examine_tapestry"},
        {"label": "Accept the explanation.", "target": "night3_accept_tapestry"},
        {"label": "\"This is getting out of hand. What are you hiding?\"", "target": "night3_confront_tapestry"}
      ],
      "position": {"x": 280, "y": 1260}
    },
    "night3_call_help": {
      "id": "night3_call_help",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/kitchen_evening.png",
      "music": "music/tension.wav",
      "text": "\"I'm calling someone. This isn't—you need help. Real help.\" \"I have real help.\" Morgan stands, her chair scraping back. \"The kind you can't give me. The kind no doctor can.\" \"Morgan, please—\" \"I'm tired.\" Her voice is final. \"We can talk tomorrow. Or not.\" She heads for the stairs. You stand in the empty kitchen, phone in hand, not knowing who to call. Who would believe this? Before bed, you notice something new in the upstairs hallway. A large woven tapestry, hung near the water heater closet. Abstract patterns in deep reds and browns. \"Energy flow,\" Morgan says from her doorway. \"It helps balance the space.\"",
      "choices": [
        {"label": "Examine the tapestry closely.", "target": "night3_examine_tapestry"},
        {"label": "Accept the explanation.", "target": "night3_accept_tapestry"},
        {"label": "\"This is getting out of hand. What are you hiding?\"", "target": "night3_confront_tapestry"}
      ],
      "position": {"x": 420, "y": 1260}
    },
    "night3_examine_tapestry": {
      "id": "night3_examine_tapestry",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/hallway_tapestry.png",
      "music": "music/dread.wav",
      "text": "You step closer. Run your hand along the fabric. It's heavier than it looks. Warmer, too—like it's been hanging in sunlight, though there are no windows here. The tapestry covers more wall than necessary. The edges overlap, hiding... what? The water heater closet door should be visible. It isn't. \"Goodnight,\" Morgan says, and closes her door. You stand in the hallway a long time, your hand pressed against the warm fabric, trying to convince yourself you don't feel a draft behind it. Breathing slowly from somewhere you can't see.",
      "choices": [
        {"label": "Continue", "target": "night4_gone"}
      ],
      "position": {"x": 140, "y": 1400}
    },
    "night3_accept_tapestry": {
      "id": "night3_accept_tapestry",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/hallway_tapestry.png",
      "music": "music/uneasy.wav",
      "text": "\"Okay,\" you say. Because what else can you say? It's fabric on a wall. Weird, but harmless. Right? Morgan smiles. \"Goodnight.\" \"Goodnight.\" But you don't sleep well. You dream of walls that breathe. Of doors that open from the inside.",
      "choices": [
        {"label": "Continue", "target": "night4_gone"}
      ],
      "position": {"x": 280, "y": 1400}
    },
    "night3_confront_tapestry": {
      "id": "night3_confront_tapestry",
      "act": 1,
      "scene": "night3",
      "background": "backgrounds/hallway_tapestry.png",
      "music": "music/tension.wav",
      "text": "\"What's behind this?\" You reach for the edge of the tapestry. Morgan's hand catches your wrist. Her grip is stronger than it should be. \"Please.\" Her voice is barely a whisper. \"Not yet. I'm not ready.\" \"Ready for what?\" But she's already letting go. Already retreating to her room. \"Goodnight,\" she says. The door closes. You stand alone in the hallway, staring at the tapestry, feeling the warmth bleeding through the fabric. Telling yourself it's the water heater. That's all. Just the water heater.",
      "choices": [
        {"label": "Continue", "target": "night4_gone"}
      ],
      "position": {"x": 420, "y": 1400}
    },
    "night4_gone": {
      "id": "night4_gone",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/house_dark.png",
      "music": "music/dread.wav",
      "text": "You come home the next night. The house is dark. Silent. Wrong. No lights. No TV murmur. No soup smell. Just emptiness pressing against every surface. \"Morgan?\" Your voice echoes. No answer. You check the living room. The kitchen. The backyard. Nothing. Her medication is on the counter. Her phone on the nightstand. Her shoes by the door. But Morgan is gone.",
      "choices": [
        {"label": "Check her bedroom first.", "target": "night4_search_bedroom"},
        {"label": "Check the bathroom—fear twisting in your gut.", "target": "night4_search_bathroom"},
        {"label": "Go straight to the backyard.", "target": "night4_search_backyard"}
      ],
      "position": {"x": 280, "y": 1540}
    },
    "night4_search_bedroom": {
      "id": "night4_search_bedroom",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/bedroom_empty.png",
      "music": "music/dread.wav",
      "text": "Her bed is made. Not slept in. The pendant is gone—the only thing missing. On her nightstand, a book lies open. Not a book you recognize. Handwritten. The page shows a symbol you've seen before: circle, vertical line. And words in a language you don't recognize. After thirty minutes of searching, calling her phone, walking the neighborhood—nothing. She's gone. Vanished. As if she was never here at all.",
      "choices": [
        {"label": "Call 911 immediately.", "target": "night4_call_911"},
        {"label": "Call Elena, her former caretaker.", "target": "night4_call_elena"},
        {"label": "Drive around the neighborhood looking.", "target": "night4_search_drive"}
      ],
      "position": {"x": 140, "y": 1680}
    },
    "night4_search_bathroom": {
      "id": "night4_search_bathroom",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/bathroom_empty.png",
      "music": "music/dread.wav",
      "text": "Your heart pounds as you push open the door. Empty. No one there. You sag against the doorframe, relief and confusion warring in your chest. She's not here. But she's not... she didn't... You search the rest of the house. Nothing. No sign of struggle. No note. Just absence. Her medication untaken. Her phone uncharged. Her shoes by the door. After thirty minutes of searching, calling, walking the neighborhood—nothing. She's vanished.",
      "choices": [
        {"label": "Call 911 immediately.", "target": "night4_call_911"},
        {"label": "Call Elena, her former caretaker.", "target": "night4_call_elena"},
        {"label": "Drive around the neighborhood looking.", "target": "night4_search_drive"}
      ],
      "position": {"x": 280, "y": 1680}
    },
    "night4_search_backyard": {
      "id": "night4_search_backyard",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/backyard_night.png",
      "music": "music/dread.wav",
      "text": "The backyard is empty. Moonlight on dead grass. The old swing set from childhood, rusted and still. You circle the house. Check the shed. Nothing. She's not outside. She's not inside. She's just... gone. After thirty minutes of searching, calling her phone, walking the neighborhood—nothing. Vanished. Without shoes. Without medication. Without a trace.",
      "choices": [
        {"label": "Call 911 immediately.", "target": "night4_call_911"},
        {"label": "Call Elena, her former caretaker.", "target": "night4_call_elena"},
        {"label": "Drive around the neighborhood looking.", "target": "night4_search_drive"}
      ],
      "position": {"x": 420, "y": 1680}
    },
    "night4_call_911": {
      "id": "night4_call_911",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/living_room_police.png",
      "music": "music/somber.wav",
      "text": "The police arrive within the hour. They take notes. Ask questions. Look at you with that practiced sympathy that means they've seen this before. Missing persons. Chronically ill. \"We'll do everything we can,\" they say. You know what that means.",
      "choices": [
        {"label": "Continue", "target": "search_montage"}
      ],
      "position": {"x": 140, "y": 1820}
    },
    "night4_call_elena": {
      "id": "night4_call_elena",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/living_room_night.png",
      "music": "music/somber.wav",
      "text": "Elena answers on the third ring. When you tell her, her breath catches. \"Oh no. Oh no, no.\" \"You knew something was wrong.\" \"I... I noticed things. The last few weeks. She was different. Drawing things. Talking about 'going home.'\" She pauses. \"You should call the police. Now.\" You do. They arrive within the hour. Take notes. Ask questions. Promise to do everything they can.",
      "choices": [
        {"label": "Continue", "target": "search_montage"}
      ],
      "position": {"x": 280, "y": 1820}
    },
    "night4_search_drive": {
      "id": "night4_search_drive",
      "act": 2,
      "scene": "night4",
      "background": "backgrounds/car_night.png",
      "music": "music/somber.wav",
      "text": "You drive for hours. Every street. Every parking lot. The hospital. The park. The old church she used to like. Nothing. Eventually, you have to admit it. This isn't something you can fix with driving in circles. You call the police. They arrive. They ask questions. They look at you with sympathy you don't want.",
      "choices": [
        {"label": "Continue", "target": "search_montage"}
      ],
      "position": {"x": 420, "y": 1820}
    },
    "search_montage": {
      "id": "search_montage",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/police_station.png",
      "music": "music/somber.wav",
      "text": "Two weeks blur together. Police interviews. Search parties. Flyers on every telephone pole in a five-mile radius. Detective Marsh leads the investigation. He's kind, thorough, and increasingly pessimistic with each passing day. They investigate the Threshold Assembly. Find a defunct website. A P.O. box that leads nowhere. \"It's like they never existed,\" Marsh tells you. \"Except in her computer history. And a few others like her.\" Others. Like Morgan. All missing. All with chronic illnesses. All vanished without a trace.",
      "choices": [
        {"label": "Continue", "target": "search_marsh_interview"}
      ],
      "position": {"x": 280, "y": 1960}
    },
    "search_marsh_interview": {
      "id": "search_marsh_interview",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/police_station.png",
      "music": "music/somber.wav",
      "text": "Detective Marsh sits across from you. Coffee cups and case files between you. \"I need to ask about Morgan's mental state,\" he says. \"In the weeks before she disappeared.\"",
      "choices": [
        {"label": "Tell him everything—the cult, the pendant, the strange behavior.", "target": "search_tell_all"},
        {"label": "Downplay it. \"She was sick, but not crazy.\"", "target": "search_downplay"},
        {"label": "Withhold the details about the pendant and 'what's underneath.'", "target": "search_withhold"}
      ],
      "position": {"x": 280, "y": 2100}
    },
    "search_tell_all": {
      "id": "search_tell_all",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/police_station.png",
      "music": "music/somber.wav",
      "text": "You tell him everything. The support group. The pendant. The incense and sitting in the dark. \"What's underneath.\" The tapestry. Follow the warm air. Marsh writes it all down. His expression doesn't change, but you can see it in his eyes—he thinks this is grief talking. Delusion. \"We'll look into it,\" he says. He doesn't believe you. But at least it's on record.",
      "choices": [
        {"label": "Continue", "target": "search_elena_call"}
      ],
      "position": {"x": 140, "y": 2240}
    },
    "search_downplay": {
      "id": "search_downplay",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/police_station.png",
      "music": "music/somber.wav",
      "text": "\"She was sick,\" you say. \"Chronic illness. Pain, fatigue—it wears on you. But she wasn't... she wasn't unstable. She was just looking for something to help.\" Marsh nods, writes something down. \"These support groups—sometimes they give people hope where medicine can't. Sometimes that hope leads them to make... decisions.\" He doesn't say suicide. Doesn't have to. \"She didn't hurt herself,\" you say. Certain, even if you don't know why. \"She went somewhere.\"",
      "choices": [
        {"label": "Continue", "target": "search_elena_call"}
      ],
      "position": {"x": 280, "y": 2240}
    },
    "search_withhold": {
      "id": "search_withhold",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/police_station.png",
      "music": "music/somber.wav",
      "text": "You tell him most of it. The support group. The change in behavior. But you don't mention the pendant. Don't mention \"what's underneath\" or the warm air or the way the tapestry pulsed with heat. Those things are yours. Clues you're not ready to share. Evidence that sounds crazy when you say it out loud. Marsh seems satisfied. \"We're doing everything we can,\" he says. You believe him. You just don't think it will be enough.",
      "choices": [
        {"label": "Continue", "target": "search_elena_call"}
      ],
      "position": {"x": 420, "y": 2240}
    },
    "search_elena_call": {
      "id": "search_elena_call",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/living_room_day.png",
      "music": "music/somber.wav",
      "text": "Elena calls you a week later. \"I need to tell you something,\" she says. \"About Morgan. In the weeks before... before. She was drawing something. Obsessively. Whenever you weren't home.\"",
      "choices": [
        {"label": "\"What was she drawing?\"", "target": "elena_describe"},
        {"label": "\"Do you still have any of the drawings?\"", "target": "elena_drawings"},
        {"label": "\"Did she ever mention the Threshold Assembly to you?\"", "target": "elena_assembly"}
      ],
      "position": {"x": 280, "y": 2380}
    },
    "elena_describe": {
      "id": "elena_describe",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/living_room_day.png",
      "music": "music/dread.wav",
      "text": "Elena is quiet for a moment. \"Tunnels,\" she says finally. \"Concentric circles, going down. Like a spiral. And at the bottom—\" Her voice catches. \"Something. I couldn't tell what. She wouldn't let me look for long.\" Tunnels. Going down. You think about the warm air. The tapestry. The water heater closet that suddenly seems much more significant.",
      "choices": [
        {"label": "Continue", "target": "funeral"}
      ],
      "position": {"x": 140, "y": 2520}
    },
    "elena_drawings": {
      "id": "elena_drawings",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/living_room_day.png",
      "music": "music/dread.wav",
      "text": "\"I have one,\" Elena says. \"She threw most of them away, but I saved one. It was just so... detailed. I thought maybe a doctor should see it.\" She sends you a photo. The drawing is exactly what you feared. Concentric circles spiraling downward. A tunnel that goes deeper than any tunnel should. And at the bottom, something formless and waiting. Your hands shake as you look at it.",
      "choices": [
        {"label": "Continue", "target": "funeral"}
      ],
      "position": {"x": 280, "y": 2520}
    },
    "elena_assembly": {
      "id": "elena_assembly",
      "act": 2,
      "scene": "search",
      "background": "backgrounds/living_room_day.png",
      "music": "music/dread.wav",
      "text": "\"The Threshold Assembly?\" Elena sounds confused. \"No. Never by name. But she talked about 'the group.' About how they understood her in ways no one else could.\" She pauses. \"She said they showed her something. Something under the house. I thought she meant... metaphorically. The subconscious or something.\" Under the house. The words echo. \"Elena,\" you say slowly. \"Did Morgan ever mention anything about tunnels?\" Silence. Then: \"She was drawing them. For weeks. Tunnels going down.\"",
      "choices": [
        {"label": "Continue", "target": "funeral"}
      ],
      "position": {"x": 420, "y": 2520}
    },
    "funeral": {
      "id": "funeral",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/cemetery.png",
      "music": "music/grief.wav",
      "text": "Two weeks pass. No body is found. The search is called off. Morgan is declared dead. The funeral is small. A handful of people who knew her from before she got sick. Some coworkers. Elena, crying quietly in the back. Detective Marsh, standing at the edges, watching. The casket is empty. A symbolic burial for someone who simply ceased to exist. Afterward, a stranger approaches you. Well-dressed. Calm. They offer condolences. \"Morgan spoke very highly of you,\" they say. \"They wanted you to have this.\" They hand you an envelope.",
      "choices": [
        {"label": "Take it and open it immediately.", "target": "funeral_open_now"},
        {"label": "Take it but wait until later.", "target": "funeral_open_later"},
        {"label": "\"Who the hell are you?\"", "target": "funeral_refuse"}
      ],
      "position": {"x": 280, "y": 2660}
    },
    "funeral_open_now": {
      "id": "funeral_open_now",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/cemetery.png",
      "music": "music/dread.wav",
      "text": "You tear it open right there, fingers trembling. Inside is a single piece of paper. A hand-drawn map of your house's second floor. An X marks the water heater closet. On the back, written in Morgan's handwriting: \"THE DOOR OPENS FROM INSIDE.\" When you look up, the stranger is gone. Vanished into the crowd of mourners. As if they were never there at all.",
      "choices": [
        {"label": "Show the map to Detective Marsh.", "target": "funeral_show_marsh"},
        {"label": "Keep it to yourself.", "target": "funeral_keep_secret"},
        {"label": "Burn it.", "target": "funeral_burn"}
      ],
      "position": {"x": 140, "y": 2800}
    },
    "funeral_open_later": {
      "id": "funeral_open_later",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/living_room_night.png",
      "music": "music/dread.wav",
      "text": "You pocket the envelope. Wait until you're home, alone, before opening it. Inside is a single piece of paper. A hand-drawn map of your house's second floor. An X marks the water heater closet. On the back, in Morgan's handwriting: \"THE DOOR OPENS FROM INSIDE.\" You stare at the words for a long time. Follow the warm air. The door opens from inside. It's starting to make a terrible kind of sense.",
      "choices": [
        {"label": "Show the map to Detective Marsh.", "target": "funeral_show_marsh"},
        {"label": "Keep it to yourself.", "target": "funeral_keep_secret"},
        {"label": "Burn it.", "target": "funeral_burn"}
      ],
      "position": {"x": 280, "y": 2800}
    },
    "funeral_refuse": {
      "id": "funeral_refuse",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/cemetery.png",
      "music": "music/tension.wav",
      "text": "\"Who are you? How do you know Morgan?\" The stranger just smiles. Patient. Unbothered. \"Someone who understands what Morgan was going through. Better than most.\" They press the envelope into your hand before you can refuse again. \"When you're ready,\" they say. \"You'll understand.\" They walk away. By the time you think to follow, they've disappeared into the crowd. The envelope feels warm in your hand. You open it later, alone. A map of your house. An X on the water heater closet. And on the back: \"THE DOOR OPENS FROM INSIDE.\"",
      "choices": [
        {"label": "Show the map to Detective Marsh.", "target": "funeral_show_marsh"},
        {"label": "Keep it to yourself.", "target": "funeral_keep_secret"},
        {"label": "Burn it.", "target": "funeral_burn"}
      ],
      "position": {"x": 420, "y": 2800}
    },
    "funeral_show_marsh": {
      "id": "funeral_show_marsh",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/police_station.png",
      "music": "music/somber.wav",
      "text": "Marsh looks at the map for a long time. \"This could be evidence,\" he says finally. \"Of what, I don't know. But I'll have someone check out the water heater closet.\" They do. They find nothing. Just a closet. Just a water heater. Marsh calls you, apologetic. \"I'm sorry. I know you were hoping for answers.\" You hang up. Stare at the tapestry still hanging in the hallway. They didn't look behind it. They didn't feel the warmth.",
      "choices": [
        {"label": "Continue", "target": "months_later"}
      ],
      "position": {"x": 140, "y": 2940}
    },
    "funeral_keep_secret": {
      "id": "funeral_keep_secret",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/living_room_night.png",
      "music": "music/dread.wav",
      "text": "You keep the map. Fold it carefully. Put it in your nightstand drawer. Some things aren't meant for police reports. Some things you have to understand yourself first. The door opens from inside. You think about that for days. Weeks. What kind of door? And what's on the other side?",
      "choices": [
        {"label": "Continue", "target": "months_later"}
      ],
      "position": {"x": 280, "y": 2940}
    },
    "funeral_burn": {
      "id": "funeral_burn",
      "act": 2,
      "scene": "funeral",
      "background": "backgrounds/fireplace.png",
      "music": "music/dread.wav",
      "text": "You hold the map over a flame. Watch it curl and blacken. Some knowledge is dangerous. Some doors should stay closed. But even as the paper turns to ash, you can't burn the words from your memory. THE DOOR OPENS FROM INSIDE. You dream about it for weeks. A door that wasn't there. A warmth that shouldn't exist. Something waiting on the other side.",
      "choices": [
        {"label": "Continue", "target": "months_later"}
      ],
      "position": {"x": 420, "y": 2940}
    },
    "months_later": {
      "id": "months_later",
      "act": 3,
      "scene": "months_later",
      "background": "backgrounds/house_day_grey.png",
      "music": "music/emptiness.wav",
      "text": "Three months pass. The world moves on. You don't. You live in a fog. Work. Home. Sleep. Repeat. The house feels different now—emptier, obviously, but something else too. Like it's watching. Waiting. Morgan's things are still everywhere. You can't bring yourself to pack them up. Can't bring yourself to stay, either. Most nights you sleep on the couch, TV murmuring, trying not to think about the upstairs hallway. The tapestry you still haven't moved.",
      "choices": [
        {"label": "Drinking. The nights are easier with something to blur them.", "target": "coping_drinking"},
        {"label": "Working obsessively. Filling every hour.", "target": "coping_working"},
        {"label": "Going through Morgan's things, looking for answers.", "target": "coping_searching"},
        {"label": "Avoiding the house entirely.", "target": "coping_avoiding"}
      ],
      "position": {"x": 280, "y": 3080}
    },
    "coping_drinking": {
      "id": "coping_drinking",
      "act": 3,
      "scene": "months_later",
      "background": "backgrounds/living_room_night.png",
      "music": "music/emptiness.wav",
      "text": "The bottle helps. Blurs the edges. Makes the silence feel less like an accusation. You drink until you can't remember why you're drinking, and that's the point. One night, you wake at 3:17 AM. Stone sober, impossibly, heart pounding. There's a sound coming from upstairs. Rhythmic. Persistent. Not footsteps. Something like knocking. From inside the walls.",
      "choices": [
        {"label": "Investigate immediately.", "target": "wrongness_investigate"},
        {"label": "Pull the covers over your head. You're imagining it.", "target": "wrongness_deny"},
        {"label": "Record it on your phone.", "target": "wrongness_record"}
      ],
      "position": {"x": 60, "y": 3220}
    },
    "coping_working": {
      "id": "coping_working",
      "act": 3,
      "scene": "months_later",
      "background": "backgrounds/office_night.png",
      "music": "music/emptiness.wav",
      "text": "You take on extra shifts. Volunteer for overtime. Stay late, come early. Anything to avoid the empty house and its waiting silence. Your boss asks if you're okay. You say yes. Neither of you believes it. One night you come home, exhausted, planning to collapse into bed without thinking. Instead, you freeze in the doorway. There's a sound coming from upstairs. Rhythmic. Persistent. Not footsteps. Something like knocking. From inside the walls.",
      "choices": [
        {"label": "Investigate immediately.", "target": "wrongness_investigate"},
        {"label": "Tell yourself you're imagining it. Go to bed.", "target": "wrongness_deny"},
        {"label": "Record it on your phone.", "target": "wrongness_record"}
      ],
      "position": {"x": 200, "y": 3220}
    },
    "coping_searching": {
      "id": "coping_searching",
      "act": 3,
      "scene": "months_later",
      "background": "backgrounds/bedroom_searching.png",
      "music": "music/emptiness.wav",
      "text": "You go through everything. Every drawer, every journal, every scrap of paper. Looking for something—you're not sure what. Answers. Explanations. Proof that you're not losing your mind. You find her old drawings. The tunnels. The circles going down. The thing at the bottom that might be a shape or might be nothing at all. One night, you fall asleep at her desk. Wake at 3:17 AM to a sound. Rhythmic. Persistent. Not footsteps. Something like knocking. From inside the walls.",
      "choices": [
        {"label": "Investigate immediately.", "target": "wrongness_investigate"},
        {"label": "Tell yourself you're imagining it.", "target": "wrongness_deny"},
        {"label": "Record it on your phone.", "target": "wrongness_record"}
      ],
      "position": {"x": 340, "y": 3220}
    },
    "coping_avoiding": {
      "id": "coping_avoiding",
      "act": 3,
      "scene": "months_later",
      "background": "backgrounds/car_night.png",
      "music": "music/emptiness.wav",
      "text": "You stay late at work. Sleep on friends' couches. Do anything to avoid the house and its terrible silence. When you do go home, you move quickly, eyes averted, in and out before the walls can notice you. But eventually you run out of excuses. Run out of couches. One night, you have to stay. And at 3:17 AM, you wake to a sound. Rhythmic. Persistent. Not footsteps. Something like knocking. From inside the walls.",
      "choices": [
        {"label": "Investigate immediately.", "target": "wrongness_investigate"},
        {"label": "Tell yourself you're imagining it.", "target": "wrongness_deny"},
        {"label": "Record it on your phone.", "target": "wrongness_record"}
      ],
      "position": {"x": 480, "y": 3220}
    },
    "wrongness_investigate": {
      "id": "wrongness_investigate",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/hallway_dark.png",
      "music": "music/horror.wav",
      "text": "You creep up the stairs, heart hammering. The knocking continues—rhythmic, patient. It's coming from behind the tapestry. You're certain now. When you reach the hallway, it stops. Just silence. Just the warm air bleeding through the fabric. You stand there for a long time, hand raised, almost touching the tapestry. Almost pulling it aside. You don't. Not yet. You go back to bed. You don't sleep.",
      "choices": [
        {"label": "Continue", "target": "wrongness_pendant"}
      ],
      "position": {"x": 140, "y": 3360}
    },
    "wrongness_deny": {
      "id": "wrongness_deny",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/bedroom_dark.png",
      "music": "music/horror.wav",
      "text": "Old houses. Pipes. Settling foundations. That's all it is. You pull the blanket over your head and force yourself to breathe. The knocking continues for exactly seven more minutes. You count. Then silence. Just the sound of your own heartbeat, too loud in the dark.",
      "choices": [
        {"label": "Continue", "target": "wrongness_pendant"}
      ],
      "position": {"x": 280, "y": 3360}
    },
    "wrongness_record": {
      "id": "wrongness_record",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/bedroom_dark.png",
      "music": "music/horror.wav",
      "text": "Your hands shake as you pull out your phone. Press record. The knocking fills the tiny speaker—rhythmic, persistent, almost like... You play it back the next morning, in daylight, with coffee. The knocking sounds almost like a pattern. Like morse code. You look up the translation. It doesn't make sense: COME DOWN COME DOWN COME DOWN. You delete the recording. Your hands are shaking again.",
      "choices": [
        {"label": "Continue", "target": "wrongness_pendant"}
      ],
      "position": {"x": 420, "y": 3360}
    },
    "wrongness_pendant": {
      "id": "wrongness_pendant",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/bedroom_day.png",
      "music": "music/dread.wav",
      "text": "A few days later, you notice something wrong in Morgan's room. The pendant—you kept it after she disappeared, couldn't bring yourself to throw it away—was in the nightstand drawer. Locked. You're certain. Now it's on top of the nightstand. Facing the door. As if it's been waiting for you.",
      "choices": [
        {"label": "Throw it away.", "target": "pendant_throw"},
        {"label": "Put it back in the drawer and lock it again.", "target": "pendant_lock"},
        {"label": "Wear it. Feel closer to Morgan.", "target": "pendant_wear"},
        {"label": "Research the symbol.", "target": "pendant_research"}
      ],
      "position": {"x": 280, "y": 3500}
    },
    "pendant_throw": {
      "id": "pendant_throw",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/trash.png",
      "music": "music/dread.wav",
      "text": "You throw it in the trash. Take the bag out to the curb for good measure. Some things need to be gone. The next morning, it's on your pillow. Circle and line, warm against the fabric, as if it had never left.",
      "choices": [
        {"label": "Continue", "target": "wrongness_tapestry"}
      ],
      "position": {"x": 60, "y": 3640}
    },
    "pendant_lock": {
      "id": "pendant_lock",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/bedroom_day.png",
      "music": "music/dread.wav",
      "text": "You put it back. Lock the drawer. Check the lock twice. Three times. It stays there for two days. On the third morning, it's on your bathroom sink. Waiting.",
      "choices": [
        {"label": "Continue", "target": "wrongness_tapestry"}
      ],
      "position": {"x": 200, "y": 3640}
    },
    "pendant_wear": {
      "id": "pendant_wear",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/mirror.png",
      "music": "music/dread.wav",
      "text": "You slip the cord over your head. The pendant settles against your chest, warm despite the cold room. For a moment, you feel something—a connection. A presence. Morgan, maybe. Or something wearing her memory like a coat. The warmth spreads through you. It feels like understanding. It feels like coming home.",
      "choices": [
        {"label": "Continue", "target": "wrongness_tapestry"}
      ],
      "position": {"x": 340, "y": 3640}
    },
    "pendant_research": {
      "id": "pendant_research",
      "act": 3,
      "scene": "wrongness",
      "background": "backgrounds/computer.png",
      "music": "music/dread.wav",
      "text": "You spend hours searching. The symbol predates the Threshold Assembly by centuries. It appears in occult texts, alchemical manuscripts, scattered references across a dozen dead religions. Always the same meaning: the threshold between above and below. The crossing point. The door that opens both ways. One text calls it \"the mark of those who go down and do not return as themselves.\" You close the laptop. The pendant sits on the desk beside you, somehow warmer than before.",
      "choices": [
        {"label": "Continue", "target": "wrongness_tapestry"}
      ],
      "position": {"x": 480, "y": 3640}
    },
    "wrongness_tapestry": {
      "id": "wrongness_tapestry",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hallway_tapestry.png",
      "music": "music/horror.wav",
      "text": "Days pass. The wrongness accumulates like dust. Sounds in the walls. Objects that move when you're not looking. Dreams of spiraling tunnels and something waiting at the bottom. Then the water heater breaks. Of course it does. You're doing laundry when you notice the tapestry moving. Billowing slightly, like there's a draft behind it. Warm air seeps around its edges. The kind of warmth that shouldn't exist in a hallway. The kind Morgan told you to follow.",
      "choices": [
        {"label": "Tear down the tapestry immediately.", "target": "discovery_tear_down"},
        {"label": "Look behind it carefully.", "target": "discovery_careful"},
        {"label": "Leave it. You're not ready.", "target": "discovery_not_ready"}
      ],
      "position": {"x": 280, "y": 3780}
    },
    "discovery_tear_down": {
      "id": "discovery_tear_down",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hidden_door.png",
      "music": "music/horror.wav",
      "text": "You grab the fabric and pull. It comes down in a heap of dust and fibers. Behind it, where the water heater closet should be, is something else entirely. A seam in the wall. A door that shouldn't exist. It's slightly ajar. Warm, stale air seeps through the crack. You hear something—maybe just air moving. Maybe breathing.",
      "choices": [
        {"label": "Open the door.", "target": "discovery_open"},
        {"label": "Call Detective Marsh first.", "target": "discovery_call_marsh"},
        {"label": "Get a weapon first.", "target": "discovery_weapon"}
      ],
      "position": {"x": 140, "y": 3920}
    },
    "discovery_careful": {
      "id": "discovery_careful",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hidden_door.png",
      "music": "music/horror.wav",
      "text": "You lift the edge of the tapestry. Slowly. Carefully. The warm air hits your face immediately—thick, humid, smelling of earth and something else. Something organic. Behind the tapestry is not the water heater closet. It's a door. A door that shouldn't exist, set into a wall that should be solid. It's slightly ajar. Darkness beyond. Breathing darkness.",
      "choices": [
        {"label": "Open the door.", "target": "discovery_open"},
        {"label": "Call Detective Marsh first.", "target": "discovery_call_marsh"},
        {"label": "Get a weapon first.", "target": "discovery_weapon"}
      ],
      "position": {"x": 280, "y": 3920}
    },
    "discovery_not_ready": {
      "id": "discovery_not_ready",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hallway_tapestry.png",
      "music": "music/horror.wav",
      "text": "You turn away. Go back downstairs. Pour yourself a drink. Try to forget the warmth, the movement, the sense of something waiting just behind the fabric. You're not ready. You may never be ready. That night, you wake standing in the upstairs hallway. The tapestry is on the floor. The door is open. You don't remember getting out of bed. You don't remember pulling down the tapestry. But here you are. Standing at the threshold. Warm air breathing against your face.",
      "choices": [
        {"label": "Open the door.", "target": "discovery_open"},
        {"label": "Call Detective Marsh first.", "target": "discovery_call_marsh"},
        {"label": "Get a weapon first.", "target": "discovery_weapon"}
      ],
      "position": {"x": 420, "y": 3920}
    },
    "discovery_open": {
      "id": "discovery_open",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/spiral_stairs.png",
      "music": "music/descent.wav",
      "text": "You push the door open. Beyond it is not a closet. Not a water heater. It's a narrow passage. And a staircase—spiraling down into darkness. The stairs are carved from stone, worn smooth by countless feet. They look ancient. Far older than the house. Far older than anything should be. Warm air rises from below, carrying the scent of earth and time and something alive.",
      "choices": [
        {"label": "Descend immediately.", "target": "level1_antechamber"},
        {"label": "Go back. Prepare. Return tomorrow.", "target": "discovery_prepare"},
        {"label": "Seal the door and try to forget.", "target": "discovery_seal"}
      ],
      "position": {"x": 140, "y": 4060}
    },
    "discovery_call_marsh": {
      "id": "discovery_call_marsh",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hidden_door.png",
      "music": "music/tension.wav",
      "text": "You call Marsh. Tell him what you found. He's skeptical but agrees to come look. When he arrives, the door is gone. Just a wall. Just a water heater closet. \"Grief does strange things,\" he says gently. You stand in the hallway after he leaves, hand pressed against solid wall. Knowing what you saw. Knowing what's behind it. That night, the door reappears. This time, you don't hesitate.",
      "choices": [
        {"label": "Open the door.", "target": "discovery_open"}
      ],
      "position": {"x": 280, "y": 4060}
    },
    "discovery_weapon": {
      "id": "discovery_weapon",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hidden_door.png",
      "music": "music/tension.wav",
      "text": "You find a kitchen knife. Heavy. Real. Something solid to hold onto. Then you return to the door. It's still there. Still waiting. Still breathing warm air into the hallway. The knife feels useless somehow. Whatever is down there, you sense it can't be hurt by something so small. But you hold it anyway. It's the only armor you have.",
      "choices": [
        {"label": "Open the door and descend.", "target": "level1_antechamber"}
      ],
      "position": {"x": 420, "y": 4060}
    },
    "discovery_prepare": {
      "id": "discovery_prepare",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/bedroom_dark.png",
      "music": "music/dread.wav",
      "text": "You step back. Close the door—but not all the way. Tomorrow. Tomorrow you'll be ready. You gather supplies: flashlight, phone, water bottle. Sensible things. Human things. You try to sleep. Dream of Morgan's face, smiling in the dark. \"You came,\" she says. \"I knew you would.\" You wake at 3:17 AM. You're already walking toward the stairs.",
      "choices": [
        {"label": "Continue", "target": "level1_antechamber"}
      ],
      "position": {"x": 140, "y": 4200}
    },
    "discovery_seal": {
      "id": "discovery_seal",
      "act": 3,
      "scene": "discovery",
      "background": "backgrounds/hallway_sealed.png",
      "music": "music/dread.wav",
      "text": "You slam the door. Nail boards across it. Push a dresser in front. This is insane. This is impossible. Doors don't appear in walls. Staircases don't exist under houses. You're losing your mind with grief, that's all. That night, you wake standing at the door. The dresser is back against the wall. The boards are neatly stacked in the corner. The door is open. And your feet are on the first step, already descending, before your mind catches up.",
      "choices": [
        {"label": "Continue", "target": "level1_antechamber"}
      ],
      "position": {"x": 280, "y": 4200}
    },
    "level1_antechamber": {
      "id": "level1_antechamber",
      "act": 4,
      "scene": "level1",
      "background": "backgrounds/antechamber.png",
      "music": "music/descent.wav",
      "text": "The stone stairs spiral down for what feels like hours. The walls are covered in symbols—the same symbol from the pendant, repeated hundreds of times. Some carved. Some drawn in something dark and flaking. Finally, the stairs open into a chamber. Stone walls. Dirt floor. And signs of habitation. Sleeping bags. Empty water bottles. Journals scattered across the ground. This was a meeting place. A gathering point. Someone—many someones—were here before you.",
      "choices": [
        {"label": "Read the journals.", "target": "level1_journals"},
        {"label": "Search for another exit.", "target": "level1_search"},
        {"label": "Call out. See if anyone responds.", "target": "level1_call"}
      ],
      "position": {"x": 280, "y": 4340}
    },
    "level1_journals": {
      "id": "level1_journals",
      "act": 4,
      "scene": "level1",
      "background": "backgrounds/antechamber.png",
      "music": "music/dread.wav",
      "text": "The journals are disturbing. Entries from dozens of different hands. Different names. Different stories. All talking about \"the descent.\" About \"shedding the body's failure.\" About \"becoming.\" The entries get stranger as you read. Fever-bright descriptions of visions. Promises of transcendence. And then, over and over, the same final words: \"I'M READY.\" After that, the pages are blank. As if the writers simply ceased to exist.",
      "choices": [
        {"label": "Continue", "target": "level1_morgan_journal"}
      ],
      "position": {"x": 140, "y": 4480}
    },
    "level1_search": {
      "id": "level1_search",
      "act": 4,
      "scene": "level1",
      "background": "backgrounds/antechamber.png",
      "music": "music/descent.wav",
      "text": "You circle the chamber, running your hands along the walls. Stone. Solid. Ancient. But there—in the far corner—a tunnel. Narrow, barely wide enough for one person, sloping further down into darkness. The warm air flows from this tunnel. And something else. A faint sound, like distant humming. A melody you almost recognize. But first, you notice the journals scattered on the ground. Morgan's handwriting catches your eye.",
      "choices": [
        {"label": "Continue", "target": "level1_morgan_journal"}
      ],
      "position": {"x": 280, "y": 4480}
    },
    "level1_call": {
      "id": "level1_call",
      "act": 4,
      "scene": "level1",
      "background": "backgrounds/antechamber.png",
      "music": "music/horror.wav",
      "text": "\"Hello?\" Your voice echoes. Bounces off stone walls and returns to you, distorted. Hollow. No answer. Just the echo dying slowly, and then—so faint you might have imagined it—something that sounds like your name. Called from very far below. You don't call out again. Instead, your eyes fall on the journals scattered across the ground. One of them has Morgan's handwriting on the cover.",
      "choices": [
        {"label": "Continue", "target": "level1_morgan_journal"}
      ],
      "position": {"x": 420, "y": 4480}
    },
    "level1_morgan_journal": {
      "id": "level1_morgan_journal",
      "act": 4,
      "scene": "level1",
      "background": "backgrounds/antechamber.png",
      "music": "music/grief.wav",
      "text": "You find Morgan's journal. Her handwriting fills the pages—cramped, urgent, increasingly unhinged. The last entry reads: \"They're wrong about one thing. It's not about dying. It's about going deeper. The lowest point is where you become. I'm not afraid. I was never afraid. I was just waiting to understand.\" The page after that is blank. But on the back cover, in tiny letters: \"Follow me down.\"",
      "choices": [
        {"label": "Take the journal with you.", "target": "level2_residences"},
        {"label": "Leave it. You don't want it.", "target": "level2_residences"},
        {"label": "Read more entries, looking for clues.", "target": "level1_more_entries"}
      ],
      "position": {"x": 280, "y": 4620}
    },
    "level1_more_entries": {
      "id": "level1_more_entries",
      "act": 4,
      "scene": "level1",
      "background": "backgrounds/antechamber.png",
      "music": "music/dread.wav",
      "text": "You read more. Hours pass, maybe—it's hard to tell down here. The entries paint a picture: the Threshold Assembly found people like Morgan. Sick. Desperate. Searching for meaning in their pain. They offered answers. Showed them the tunnels beneath their own homes. Doors that \"opened from inside.\" And one by one, the faithful went down. Descending toward something that waited. Something that wanted. None of them came back up. At least, not as themselves.",
      "choices": [
        {"label": "Continue deeper.", "target": "level2_residences"}
      ],
      "position": {"x": 280, "y": 4760}
    },
    "level2_residences": {
      "id": "level2_residences",
      "act": 4,
      "scene": "level2",
      "background": "backgrounds/residences.png",
      "music": "music/descent.wav",
      "text": "The tunnel slopes further down. The air grows thicker, warmer. And then it opens into something impossible. A neighborhood carved from stone. Alcoves in the walls, dozens of them, each one a small living space. Beds. Personal effects. Photos pinned to rough walls. Someone lived here. Many someones. It looks like it was abandoned recently. Or maybe not abandoned at all. One of the alcoves has a lantern still burning. The bed is unmade.",
      "choices": [
        {"label": "Wait and watch.", "target": "level2_wait"},
        {"label": "Search the alcove.", "target": "level2_search_alcove"},
        {"label": "Call out.", "target": "level2_call"},
        {"label": "Move past quickly.", "target": "level2_photos"}
      ],
      "position": {"x": 280, "y": 4900}
    },
    "level2_wait": {
      "id": "level2_wait",
      "act": 4,
      "scene": "level2",
      "background": "backgrounds/residences.png",
      "music": "music/tension.wav",
      "text": "You press yourself against the wall. Wait. Listen. For a long time, nothing. Just the flicker of the lantern. The thick silence of deep earth. Then—shuffling. Movement. Something deeper in the tunnel, moving away from you. Not toward. You catch a glimpse of fabric. A robe, maybe. Whoever or whatever it was, it didn't see you. Or didn't care. You move to the wall of photographs.",
      "choices": [
        {"label": "Continue", "target": "level2_photos"}
      ],
      "position": {"x": 60, "y": 5040}
    },
    "level2_search_alcove": {
      "id": "level2_search_alcove",
      "act": 4,
      "scene": "level2",
      "background": "backgrounds/alcove.png",
      "music": "music/dread.wav",
      "text": "The alcove is small but lived-in. Blankets on the bed, still warm. A cup of water, recently filled. And on the small stone shelf, a notebook open to a half-written entry: \"They said the new one would come soon. The one from above. We've been waiting—\" The entry stops mid-sentence. As if the writer was interrupted. Or called away. On the wall, photographs.",
      "choices": [
        {"label": "Continue", "target": "level2_photos"}
      ],
      "position": {"x": 200, "y": 5040}
    },
    "level2_call": {
      "id": "level2_call",
      "act": 4,
      "scene": "level2",
      "background": "backgrounds/residences.png",
      "music": "music/horror.wav",
      "text": "\"Hello?\" The word echoes strangely. Doesn't come back right. Almost sounds like a different voice returning it. No one answers. But you hear movement—shuffling footsteps retreating deeper into the tunnel. They heard you. They chose not to respond. The photographs on the wall draw your attention.",
      "choices": [
        {"label": "Continue", "target": "level2_photos"}
      ],
      "position": {"x": 340, "y": 5040}
    },
    "level2_photos": {
      "id": "level2_photos",
      "act": 4,
      "scene": "level2",
      "background": "backgrounds/photos.png",
      "music": "music/grief.wav",
      "text": "The photographs cover one wall. Dozens of them. People in robes, standing together. Smiling. Their faces are calm, peaceful, emptied of fear. And there—in the center of one photo—is Morgan. Standing with the others. Smiling that same empty smile. Behind the group, a massive dark opening. A pit, yawning wide. Morgan's hand is raised, pointing toward it. Inviting you to follow.",
      "choices": [
        {"label": "Take the photograph.", "target": "level3_cathedral"},
        {"label": "Look for other faces you recognize.", "target": "level2_recognize"},
        {"label": "Keep moving. You need to find Morgan.", "target": "level3_cathedral"}
      ],
      "position": {"x": 280, "y": 5180}
    },
    "level2_recognize": {
      "id": "level2_recognize",
      "act": 4,
      "scene": "level2",
      "background": "backgrounds/photos.png",
      "music": "music/dread.wav",
      "text": "You scan the faces. Most are strangers. But one—the person from the funeral. The one who gave you the envelope. They're standing next to Morgan, hand on her shoulder. In the photo, they're smiling. Looking directly at the camera. Looking directly at you. Like they knew you'd be here. Like they've been waiting.",
      "choices": [
        {"label": "Continue", "target": "level3_cathedral"}
      ],
      "position": {"x": 280, "y": 5320}
    },
    "level3_cathedral": {
      "id": "level3_cathedral",
      "act": 4,
      "scene": "level3",
      "background": "backgrounds/cathedral.png",
      "music": "music/awe.wav",
      "text": "The tunnel opens into a cavern so vast your flashlight can't reach the ceiling. It swallows sound, swallows light, swallows everything but the sense of ancient, patient presence. In the center: an altar of dark stone. Around it, thousands of candles burned down to nothing. Rivers of hardened wax frozen on the floor like geological formations. On the altar sits a book. Handwritten. Bound in something you don't want to identify. The title page reads: \"THE RITES OF THRESHOLD.\"",
      "choices": [
        {"label": "Read the book.", "target": "level3_read_book"},
        {"label": "Destroy it.", "target": "level3_destroy_book"},
        {"label": "Leave it and continue deeper.", "target": "level3_pit"}
      ],
      "position": {"x": 280, "y": 5460}
    },
    "level3_read_book": {
      "id": "level3_read_book",
      "act": 4,
      "scene": "level3",
      "background": "backgrounds/ritual_book.png",
      "music": "music/dread.wav",
      "text": "The book describes a ritual. A \"willing descent.\" The faithful go down, and down, and down, until they reach \"the lowest place.\" There, they \"shed the body's failure\" and \"become one with what waits.\" The language is reverent, ecstatic. It speaks of transcendence. Of freedom from pain, from illness, from the prison of flesh. It speaks of becoming something larger. Something eternal. Something that was here before the house, before the tunnels, before anything at all. Behind the altar, a pit yawns in the floor. The warm air rises from it. The ladder rungs are worn smooth by countless hands.",
      "choices": [
        {"label": "Continue", "target": "level3_pit"}
      ],
      "position": {"x": 140, "y": 5600}
    },
    "level3_destroy_book": {
      "id": "level3_destroy_book",
      "act": 4,
      "scene": "level3",
      "background": "backgrounds/cathedral.png",
      "music": "music/horror.wav",
      "text": "You grab the book. Tear the pages. But they won't tear right—they flex like skin, resist like muscle. And when you try to throw it into the pit, your arm won't move. Something holds you. Not a hand. Not a force. Just a certainty, deep in your bones, that destroying this would be wrong. That this book is older than wrong and right. That it simply is. You set it back on the altar. Your hands are shaking. Behind the altar, the pit waits.",
      "choices": [
        {"label": "Continue", "target": "level3_pit"}
      ],
      "position": {"x": 280, "y": 5600}
    },
    "level3_pit": {
      "id": "level3_pit",
      "act": 4,
      "scene": "level3",
      "background": "backgrounds/pit.png",
      "music": "music/descent.wav",
      "text": "Behind the altar, a hole in the floor. A pit descending into absolute darkness. The warm air rises from it, thick and living. You can see the first rungs of a ladder, ancient iron set into stone, leading down into nothing. This is it. The lowest place. Where Morgan went. Where they all went.",
      "choices": [
        {"label": "Climb down.", "target": "level4_warren"},
        {"label": "Drop something and listen for it to hit bottom.", "target": "level3_drop"},
        {"label": "Call Morgan's name into the pit.", "target": "level3_call_morgan"}
      ],
      "position": {"x": 280, "y": 5740}
    },
    "level3_drop": {
      "id": "level3_drop",
      "act": 4,
      "scene": "level3",
      "background": "backgrounds/pit.png",
      "music": "music/horror.wav",
      "text": "You find a loose stone. Drop it into the darkness. Count the seconds. One. Two. Three. Four. Five... Ten... Twenty... There is no sound. Either the pit is bottomless, or whatever's down there absorbed the impact. Or the stone never landed at all. The ladder rungs wait.",
      "choices": [
        {"label": "Climb down.", "target": "level4_warren"}
      ],
      "position": {"x": 140, "y": 5880}
    },
    "level3_call_morgan": {
      "id": "level3_call_morgan",
      "act": 4,
      "scene": "level3",
      "background": "backgrounds/pit.png",
      "music": "music/horror.wav",
      "text": "\"Morgan?\" The name falls into the pit. Swallowed by darkness. Silence. Then, from very far below—so far it shouldn't be possible to hear anything—something that might be an echo. Or might be a response. Your name. Spoken in Morgan's voice. Warm and welcoming and utterly wrong.",
      "choices": [
        {"label": "Climb down.", "target": "level4_warren"}
      ],
      "position": {"x": 420, "y": 5880}
    },
    "level4_warren": {
      "id": "level4_warren",
      "act": 4,
      "scene": "level4",
      "background": "backgrounds/warren.png",
      "music": "music/descent.wav",
      "text": "The ladder goes down for a long time. Your arms ache. Your hands cramp on the ancient rungs. The walls close in—this is a shaft now, barely wide enough for one person, stone pressing against your shoulders. You emerge into a warren of tunnels. They branch in every direction, identical and endless. The walls are wet. The air is thick and warm. You could wander here forever and never find your way out. Unless you're careful. Unless you're smart. Unless you know how to navigate.",
      "choices": [
        {"label": "Mark your path as you go—tear cloth, scratch walls.", "target": "level4_mark"},
        {"label": "Follow the warmest air current.", "target": "level4_warmth"},
        {"label": "Follow the faint sound you keep almost hearing.", "target": "level4_sound"},
        {"label": "Trust your instincts and move randomly.", "target": "level4_instinct"}
      ],
      "position": {"x": 280, "y": 6020}
    },
    "level4_mark": {
      "id": "level4_mark",
      "act": 4,
      "scene": "level4",
      "background": "backgrounds/warren.png",
      "music": "music/descent.wav",
      "text": "You tear strips from your shirt. Leave them at each turn. Scratch arrows into the wet stone. If nothing else, you'll be able to find your way back. If there is a back. If there's anything left to go back to. The tunnels twist and branch and merge. But eventually, following the marks, correcting your course, you find yourself moving in one direction. Deeper. Toward something that feels like an ending.",
      "choices": [
        {"label": "Continue", "target": "reunion_approach"}
      ],
      "position": {"x": 60, "y": 6160}
    },
    "level4_warmth": {
      "id": "level4_warmth",
      "act": 4,
      "scene": "level4",
      "background": "backgrounds/warren.png",
      "music": "music/descent.wav",
      "text": "Follow the warm air. Morgan's words echo in your memory. You hold your hand out at each junction, feeling for the current. There—stronger on the left. And again—the right path is warmer. The warmth leads you deeper. Always deeper. Like a breath drawing you in. Like a pulse pulling you toward its source.",
      "choices": [
        {"label": "Continue", "target": "reunion_approach"}
      ],
      "position": {"x": 200, "y": 6160}
    },
    "level4_sound": {
      "id": "level4_sound",
      "act": 4,
      "scene": "level4",
      "background": "backgrounds/warren.png",
      "music": "music/grief.wav",
      "text": "There—that sound again. Humming. A melody, distant and distorted, rising from the tunnels ahead. You know that tune. Morgan used to hum it when she was tired. When she was falling asleep. You follow it through the maze, and it leads you true. The humming grows clearer. Closer. Until you can almost make out words. Almost recognize the voice.",
      "choices": [
        {"label": "Continue", "target": "reunion_approach"}
      ],
      "position": {"x": 340, "y": 6160}
    },
    "level4_instinct": {
      "id": "level4_instinct",
      "act": 4,
      "scene": "level4",
      "background": "backgrounds/warren.png",
      "music": "music/descent.wav",
      "text": "You stop thinking. Stop planning. Let your feet carry you where they will. Left, right, straight, back. The tunnels blur together. Time loses meaning. And somehow, impossibly, you find yourself moving forward. As if the maze wants you to reach its center. As if you were always meant to arrive here. As if this was never really a choice at all.",
      "choices": [
        {"label": "Continue", "target": "reunion_approach"}
      ],
      "position": {"x": 480, "y": 6160}
    },
    "reunion_approach": {
      "id": "reunion_approach",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "You emerge into a chamber. The final chamber. The lowest place. The floor is soft—not stone. Something organic. Yielding under your feet like flesh. The warmth is oppressive, tropical, wrong. And in the center of the room, sitting with their back to you, is a figure. They're wearing Morgan's clothes. Sitting perfectly still. Waiting.",
      "choices": [
        {"label": "Say their name.", "target": "reunion_name"},
        {"label": "Approach silently.", "target": "reunion_silent"},
        {"label": "Stay at the entrance. Don't go closer.", "target": "reunion_stay"}
      ],
      "position": {"x": 280, "y": 6300}
    },
    "reunion_name": {
      "id": "reunion_name",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "\"Morgan?\" The figure stiffens. Then, slowly, turns. It's Morgan—but wrong. Their face is theirs, but the proportions have shifted subtly. Eyes too calm. Smile too wide. They don't seem to breathe. \"You came.\" Their voice is Morgan's voice, but layered somehow. Echoed by something beneath it. \"I wasn't sure you would.\"",
      "choices": [
        {"label": "Continue", "target": "reunion_conversation"}
      ],
      "position": {"x": 140, "y": 6440}
    },
    "reunion_silent": {
      "id": "reunion_silent",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "You move closer, silent on the soft floor. The figure doesn't move. Doesn't acknowledge you. Until you're almost close enough to touch, and then—without turning—they speak. \"You came.\" Morgan's voice. Morgan's words. But somehow not Morgan at all. \"I felt you descending. I felt you the whole way down.\" They turn. Their face is Morgan's, but shifted. Changed. Perfected in a way that feels deeply wrong.",
      "choices": [
        {"label": "Continue", "target": "reunion_conversation"}
      ],
      "position": {"x": 280, "y": 6440}
    },
    "reunion_stay": {
      "id": "reunion_stay",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "You freeze at the threshold. Something tells you not to go closer. Not to step onto that soft, yielding floor. The figure stands. Turns. Morgan's face—but not. The proportions wrong. The smile too wide. The eyes too empty of the fear that always lived there before. \"You came.\" They take a step toward you. The floor pulses under their feet. \"I knew you would. Eventually. Everyone finds their way down, eventually.\"",
      "choices": [
        {"label": "Continue", "target": "reunion_conversation"}
      ],
      "position": {"x": 420, "y": 6440}
    },
    "reunion_conversation": {
      "id": "reunion_conversation",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "\"Morgan...\" You don't know what to say. What can you say? They're here. They're alive. They're something else entirely.",
      "choices": [
        {"label": "\"What happened to you?\"", "target": "reunion_what_happened"},
        {"label": "\"I'm here to take you home.\"", "target": "reunion_take_home"},
        {"label": "\"What is this place?\"", "target": "reunion_what_place"},
        {"label": "\"Are you... alive?\"", "target": "reunion_alive"}
      ],
      "position": {"x": 280, "y": 6580}
    },
    "reunion_what_happened": {
      "id": "reunion_what_happened",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "\"I became.\" Morgan smiles that too-wide smile. \"The illness was always going to take me. The Assembly showed me another way. I went down, and down, and down. And at the bottom, I found something that wanted me.\" They spread their arms, indicating the chamber, the darkness, the something you can feel watching from everywhere at once. \"I'm not sick anymore. I'm not dying. I'm not even really me anymore. But I remember you. I still love you.\" They extend a hand. \"You could stay. You don't have to be afraid. You don't have to be alone.\"",
      "choices": [
        {"label": "Continue", "target": "final_choice"}
      ],
      "position": {"x": 60, "y": 6720}
    },
    "reunion_take_home": {
      "id": "reunion_take_home",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "Morgan laughs. It's almost a human sound. Almost. \"Home? This is home now. More than that house ever was.\" They step closer. You can smell them now—earth and something sweeter, something organic and alive. \"The illness was going to take everything. The pain, the exhaustion, the slow vanishing of who I used to be. This was better. This is better.\" They reach for your hand. Their skin is cold but somehow also warm. Wrong temperature. Impossible temperature. \"You could stay. With me. Forever.\"",
      "choices": [
        {"label": "Continue", "target": "final_choice"}
      ],
      "position": {"x": 200, "y": 6720}
    },
    "reunion_what_place": {
      "id": "reunion_what_place",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "\"The lowest place.\" Morgan's voice echoes strangely, as if the chamber itself is speaking through them. \"Where the threshold meets what waits. What has always waited.\" The darkness around you seems to pulse. Breathe. \"It was here before the house. Before the land. Before anything at all. It doesn't want. It doesn't need. It just... is. And anyone who descends far enough becomes part of its isness.\" They extend a hand. \"You could understand. If you stayed.\"",
      "choices": [
        {"label": "Continue", "target": "final_choice"}
      ],
      "position": {"x": 340, "y": 6720}
    },
    "reunion_alive": {
      "id": "reunion_alive",
      "act": 5,
      "scene": "reunion",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "\"Alive?\" Morgan tilts their head, considering. \"That's a surface word. Up there, you're alive or you're dead. Down here...\" They gesture at the pulsing darkness. \"Down here, there are other options.\" They step closer. You can see now—they don't breathe. Their chest doesn't move. But something in them lives. Something that wears Morgan's face like a comfortable memory. \"I'm not afraid anymore. Not in pain. Not waiting to die.\" They extend a hand. \"You don't have to be either.\"",
      "choices": [
        {"label": "Continue", "target": "final_choice"}
      ],
      "position": {"x": 480, "y": 6720}
    },
    "final_choice": {
      "id": "final_choice",
      "act": 5,
      "scene": "finale",
      "background": "backgrounds/lowest_place.png",
      "music": "music/finale.wav",
      "text": "Morgan's hand hangs in the air between you. Cold fingers extended. Behind them, the darkness pulses. Watches. Waits. You can feel it—the thing beneath everything. Ancient and patient. Hungry in a way that has nothing to do with appetite. The way back is still open. For now. You can feel the ladder behind you, the tunnels, the spiral stairs rising toward light and air and the world you used to know. This is the choice. The only choice that ever mattered.",
      "choices": [
        {"label": "Take their hand. Stay. Become.", "target": "ending_a"},
        {"label": "Refuse and flee. Run. Don't look back.", "target": "ending_b"},
        {"label": "Try to pull them out by force.", "target": "ending_c"},
        {"label": "\"Show me. Help me understand.\"", "target": "ending_d"}
      ],
      "position": {"x": 280, "y": 6860}
    },
    "ending_a": {
      "id": "ending_a",
      "act": 5,
      "scene": "ending",
      "ending_type": "communion",
      "background": "backgrounds/communion.png",
      "music": "music/ending_a.wav",
      "text": "You take their hand. It's cold, then warm, then something beyond temperature. Beyond sensation. Morgan smiles—really smiles—and pulls you forward, into the darkness, into the warmth, into the vast and patient presence that waits beneath everything. You descend. Together this time. The fear dissolves. The grief dissolves. Your sense of self begins to blur at the edges, to merge with something larger. You understand now. It's not death. It's not life. It's becoming. Above, in the house that was once yours, the door seals itself. The tapestry falls back into place. Eventually, the house is sold. A young couple moves in. They seem happy. The real estate agent mentions there's a bit of draft in the upstairs hallway—probably just needs weather-stripping. Nothing to worry about. They'll get used to it. Everyone does, eventually. Everyone finds their way down.",
      "choices": [],
      "position": {"x": 60, "y": 7000},
      "is_ending": true
    },
    "ending_b": {
      "id": "ending_b",
      "act": 5,
      "scene": "ending",
      "ending_type": "escape",
      "background": "backgrounds/escape.png",
      "music": "music/ending_b.wav",
      "text": "\"No.\" You step back. Turn. Run. Behind you, Morgan doesn't chase. Doesn't call out. Just watches with those too-calm eyes as you scramble toward the ladder, the tunnels, the spiral stairs. The warren shifts around you, but you marked your path. Left here. Right there. Following the arrows scratched in stone, the torn fabric hanging from the walls. The climb is endless. Your arms burn. Your lungs scream. But finally—finally—you emerge into your own hallway, gasping, covered in dust and sweat and something darker. You seal the door. Nail it shut. Push the heaviest furniture you own against it. Then you sell the house. Take the first offer. Never look back. You move across the country. Start over. Try to forget. Mostly, you succeed. But some nights, you wake at 3:17 AM to the feeling of warm breath on the back of your neck. And you know—you will always know—that the door is still there. Waiting. In case you ever change your mind.",
      "choices": [],
      "position": {"x": 200, "y": 7000},
      "is_ending": true
    },
    "ending_c": {
      "id": "ending_c",
      "act": 5,
      "scene": "ending",
      "ending_type": "defiance",
      "background": "backgrounds/defiance.png",
      "music": "music/ending_c.wav",
      "text": "You grab Morgan's hand—not to stay, but to pull. \"We're leaving. Now.\" Morgan doesn't fight. Doesn't resist. Just looks at you with infinite sadness. \"You can't save me. I'm not lost.\" You pull harder. Drag them toward the ladder. And then the darkness moves. Not a metaphor. Not a feeling. The chamber itself contracts. The floor ripples. Something vast and ancient and utterly indifferent notices you for the first time. You are very, very small. \"Go,\" Morgan whispers. \"While it still lets you.\" You run. Somehow, impossibly, you make it. The tunnels release you. The stairs spit you out into your own hallway, alone, shaking, alive. The door seals itself behind you with a sound like a sigh. Morgan is gone. Really gone now. But when you look at your palm, there's a mark. Circle and line. The threshold symbol, burned into your skin like a brand. A reminder. A promise. A door that can never fully close.",
      "choices": [],
      "position": {"x": 340, "y": 7000},
      "is_ending": true
    },
    "ending_d": {
      "id": "ending_d",
      "act": 5,
      "scene": "ending",
      "ending_type": "understanding",
      "background": "backgrounds/understanding.png",
      "music": "music/ending_d.wav",
      "text": "\"Show me.\" Morgan takes your hand—but doesn't pull. Their cold fingers interlock with yours, and suddenly you're not in the chamber anymore. You're everywhere. Nowhere. You see the thing beneath—vast and patient, older than geology, older than time. You see the faithful, absorbed into its vastness. Not dead. Not alive. Part of something. Threads in an infinite tapestry, woven into the fabric of what waits beneath everything. You see Morgan among them. Content. Connected. Free of pain, free of fear, free of the slow betrayal of a body that was always failing them. You understand. Not everything—no human mind could hold everything—but enough. Enough to know that this isn't evil. Isn't good. It simply is. Has always been. Will always be. You wake at the base of the ladder. Alone. The chamber is empty. Morgan is gone. The tunnels behind you have collapsed. There's only one way now: up. You climb. Emerge into your hallway. The door is gone. Just a wall. Just a water heater closet. Was any of it real? You touch your chest. The pendant hangs there—Morgan's pendant—warm against your skin. You don't remember putting it on. But you know, now. You understand. And you will carry that understanding for the rest of your life. A door that opened inward. A truth you can never unknow.",
      "choices": [],
      "position": {"x": 480, "y": 7000},
      "is_ending": true
    }
  }
}
